src/main/resources/test-cases/parallelogram-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:shap="http://example.org/shapetool">
    <soapenv:Header/>
    <soapenv:Body>
        <shap:parallelogramAreaRequest>
            <shap:base>7</shap:base>
            <shap:height>3</shap:height>
        </shap:parallelogramAreaRequest>
    </soapenv:Body>
</soapenv:Envelope>