target/classes/test-cases/rectangle-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:shap="http://example.org/shapetool">
    <soapenv:Header/>
    <soapenv:Body>
        <shap:rectangleAreaRequest>
            <shap:length>6</shap:length>
            <shap:width>9</shap:width>
        </shap:rectangleAreaRequest>
    </soapenv:Body>
</soapenv:Envelope>