src/main/resources/test-cases/square-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:shap="http://example.org/shapetool">
    <soapenv:Header/>
    <soapenv:Body>
        <shap:squareAreaRequest>
            <shap:side>8</shap:side>
        </shap:squareAreaRequest>
    </soapenv:Body>
</soapenv:Envelope>